{
  "tree_proportions": {
    "relative_to_image": {
      "small_threshold": 0.4,
      "large_threshold": 0.8,
      "interpretation": {
        "small": "העץ קטן יחסית לדף, אולי כי אתה אוהב להישאר עם רגליים על הקרקע ולא לחפש להיות במרכז העניינים",
        "large": "העץ שלך תופס הרבה מקום, כנראה שיש לך נוכחות חזקה ואתה לא מפחד להיות בפרונט"
      }
    },
    "features_relative_to_each_other": {
      "trunk_canopy_ratio": {
        "thin_trunk_threshold": 0.3,
        "thick_trunk_threshold": 1.8,
        "interpretation": {
          "thin_trunk": "הגזע דק והחופה רחבה, מה שאומר שאתה כנראה יודע לזרום עם שינויים ולקחת דברים בקלילות",
          "thick_trunk": "הגזע רחב והחופה קטנה, נראה שאתה יציב, מחושב ויודע בדיוק לאן אתה הולך"
        }
      },
      "root_presence": {
        "required": true,
        "interpretation": {
          "absent": "אין שורשים? אולי אתה כרגע בתקופה של חיפוש, מוכן לשינויים ומעדיף לא להיתקע במקום אחד",
          "present": "הוספת שורשים לציור – כנראה שאתה מחובר לערכים שלך ויודע בדיוק איפה הקרקע שלך"
        }
      }
    }
  },
  "tree_location": {
    "horizontal_position": {
      "left_threshold": 0.3,
      "right_threshold": 0.7,
      "center_1_threshold": 0.45,
      "center_2_threshold": 0.55,
      "interpretation": {
       "left": "העץ נמצא בצד שמאל, כנראה שאתה טיפוס נוסטלגי שאוהב להתחבר לעבר ולערכים שלך",
        "center": "העץ בדיוק באמצע, אתה מאוזן, יציב ויודע לשמור על המרכז שלך גם כשהרוחות נושבות",
        "right": "העץ בצד ימין, יש לך שאיפות גדולות ואתה מסתכל קדימה עם מטרה ברורה"
      }
    },
    "vertical_position": {
      "low_threshold": 0.3,
      "high_threshold": 0.7,
      "center_1_threshold": 0.45,
      "center_2_threshold": 0.55,
      "interpretation": {
        "low": "העץ נמוך יחסית בדף, אולי אתה מחפש יותר יציבות או פשוט אוהב לעבוד מלמטה למעלה",
        "center": "העץ באמצע, מה שאומר שאתה מאוזן, מחובר לעצמך ויודע לשמור על פוקוס",
        "high": "העץ גבוה, יש לך מטרות גדולות ואתה לא מפחד לשאוף רחוק"
      }
    }
  },
  "canopy": {
    "size": {
      "large_threshold": 0.6,
      "small_threshold": 0.2,
      "interpretation": {
        "small": "חופה קטנה מרמזת שאתה אדם יותר פנימי, חושב לעומק ומתחבר לאנשים בקשרים משמעותיים",
        "large": "חופה גדולה מצביעה על ראש פתוח, מחשבה רחבה ויכולת להשפיע על הסביבה שלך"
      }
    },
    "shape": {
      "rounded": "החופה עגולה ולכן אתה כנראה מחפש הרמוניה ואיזון בחיים שלך",
      "pointed": "חופה מחודדת מעידה על מיקוד חזק במטרות שלך, אתה חד ומדויק בדרך שלך"
    }
  },
  "trunk": {
    "shape": {
      "straight": "גזע ישר מעיד על יציבות וביטחון, אתה פועל בצורה ישירה ולא מתפתל בדרך",
      "curved": "הגזע מעוקל אז כנראה שאתה גמיש, מסתגל טוב למצבים ומשתלב בקלות בכל סביבה"
    }
  },
  "roots": {
    "depth": {
      "shallow_threshold": 0.1,
      "deep_threshold": 0.3,
      "interpretation": {
        "shallow": "שורשים רדודים מרמזים שאתה אוהב לזרום עם החיים ולא נקשר חזק מדי למקום מסוים",
        "deep": "השורשים עמוקים וזה מעיד שיש לך חיבור חזק לערכים שלך ואתה בנוי על יסודות יציבים"
      }
    }
  }
}
