{
  "tree_proportions": {
    "relative_to_image": {
      "small_threshold": 0.25,
      "large_threshold": 0.75,
      "interpretation": {
        "small": "העץ קטן יחסית לעמוד, דבר שעשוי להעיד על צניעות וביטחון פנימי, יכולת לראות את הדברים בפרופורציה.",
        "large": "העץ גדול מאוד ביחס לעמוד, מה שמעיד על ביטחון עצמי גבוה, נטייה להוביל ולהיות במרכז תשומת הלב."
      }
    },
    "features_relative_to_each_other": {
      "trunk_canopy_ratio": {
        "thin_trunk_threshold": 0.5,
        "thick_trunk_threshold": 1.5,
        "interpretation": {
          "thin_trunk": "הגזע דק בהרבה מהחופה, דבר שעשוי להעיד על גמישות פנימית, יכולת להסתגל ולהתמודד עם אתגרים.",
          "thick_trunk": "הגזע רחב באופן משמעותי מהחופה, מה שמרמז על יציבות פנימית וביטחון עצמי חזק."
        }
      },
      "root_presence": {
        "required": true,
        "interpretation": {
          "absent": "היעדר שורשים עשוי להעיד על רצון לפתח יותר יציבות פנימית ועמידה בנסיבות משתנות.",
          "present": "נוכחות השורשים מעידה על חיבור חזק לאדמה ויציבות פנימית שמאפשרת צמיחה בריאה."
        }
      }
    }
  },
  "tree_location": {
    "horizontal_position": {
      "left_threshold": 0.3,
      "right_threshold": 0.7,
      "interpretation": {
        "left": "העץ ממוקם בצד השמאלי, מה שמעיד על קשר חזק עם עברך וערכים אישיים עמוקים.",
        "center": "העץ ממוקם במרכז, מה שמעיד על איזון פנימי ותחושת עצמי חזקה ויציבה.",
        "right": "העץ ממוקם בצד הימני, מה שמעיד על שאפתנות גדולה ויכולת להתמקד במטרות עתידיות."
      }
    },
    "vertical_position": {
      "low_threshold": 0.3,
      "high_threshold": 0.7,
      "interpretation": {
        "low": "העץ ממוקם בחלק התחתון של העמוד, דבר שעשוי להעיד על רצון לשיפור וחתירה לעבר יציבות פנימית גבוהה יותר.",
        "center": "העץ ממוקם במרכז, מה שמעיד על איזון פנימי מושלם והשגת יציבות בין הרגשות לשאיפות.",
        "high": "העץ ממוקם בחלק העליון של העמוד, דבר שמעיד על שאפתנות גבוהה, מטרות מרשימות ונכונות להשקיע בהן."
      }
    }
  },
  "canopy": {
    "size": {
      "large_threshold": 0.6,
      "small_threshold": 0.2,
      "interpretation": {
        "small": "חופה קטנה מעידה על אינדיבידואליות ומיקוד פנימי, המאפשרת יצירה של קשרים משמעותיים וחשיבה מעמיקה.",
        "large": "חופה גדולה מעידה על מחשבות רחבות ויכולת ליצור קשרים ולהשפיע על אחרים באופן חזק ומרשים."
      }
    },
    "shape": {
      "rounded": "חופה מעוגלת מעידה על הרמוניה פנימית ושאיפה לאיזון ושקט נפשי.",
      "pointed": "חופה מחודדת מרמזת על שאיפה מובהקת להשגת מטרות ומיקוד חזק בדרכים חדות וממוקדות."
    }
  },
  "trunk": {
    "shape": {
      "straight": "גזע ישר מעיד על יציבות פנימית וביטחון עצמי גבוה שמוביל לפעולות ישירות וממוקדות.",
      "curved": "גזע מעוקל מעיד על גמישות והתאמה אישית עם יכולת להסתגל לאתגרים ולהתמודד עם שינוי."
    }
  },
  "roots": {
    "depth": {
      "shallow_threshold": 0.1,
      "deep_threshold": 0.3,
      "interpretation": {
        "shallow": "שורשים רדודים מעידים על גישה פתוחה ויכולת ליצור קשרים עם אחרים באופן קל ומהיר.",
        "deep": "שורשים עמוקים מעידים על חיבור חזק ומעמיק לעקרונות אישיים, יציבות פנימית וחוסן רגשי."
      }
    }
  }
}
