{
  "tree_proportions": {
    "relative_to_image": {
      "small_threshold": 0.25,
      "large_threshold": 0.75,
      "interpretation": {
        "small": "העץ קטן יחסית לעמוד, דבר שעשוי להעיד על חוסר ביטחון, הערכה עצמית נמוכה או תחושות של אי-מסוגלות.",
        "large": "העץ גדול מאוד ביחס לעמוד, מה שמעיד על ביטחון עצמי, צורך בשליטה או נטייה לתפוס מקום במערכות יחסים."
      }
    },
    "features_relative_to_each_other": {
      "trunk_canopy_ratio": {
        "thin_trunk_threshold": 0.5,
        "thick_trunk_threshold": 1.5,
        "interpretation": {
          "thin_trunk": "הגזע דק בהרבה מהחופה, דבר שעשוי להעיד על חוסר יציבות פנימית או חוסן בהשוואה לשאיפות החיצוניות.",
          "thick_trunk": "הגזע רחב באופן משמעותי מהחופה, מה שמרמז על דגש על ביטחון, יציבות פנימית או חיבור לקרקע על חשבון צמיחה חיצונית."
        }
      },
      "root_presence": {
        "required": true,
        "interpretation": {
          "absent": "היעדר שורשים עשוי להעיד על חוסר חיבור למציאות, חוסר יציבות או חוסר יסודות אישיים.",
          "present": "נוכחות השורשים מעידה על יציבות, קרקע מוצקה וחיבור חזק ליסודות אישיים."
        }
      }
    }
  },
  "tree_location": {
    "horizontal_position": {
      "left_threshold": 0.3,
      "right_threshold": 0.7,
      "interpretation": {
        "left": "העץ ממוקם בצד השמאלי, מה שמעיד על התמקדות בעבר, במשפחה או בחיים פנימיים.",
        "center": "העץ ממוקם במרכז, מה שמעיד על איזון בתפיסת החיים ועל תחושת עצמי חזקה.",
        "right": "העץ ממוקם בצד הימני, מה שמעיד על שאפתנות, חשיבה לעתיד והתמקדות במטרות."
      }
    },
    "vertical_position": {
      "low_threshold": 0.3,
      "high_threshold": 0.7,
      "interpretation": {
        "low": "העץ ממוקם בחלק התחתון של העמוד, דבר שעשוי להעיד על חוסר ביטחון, ביטחון עצמי נמוך או תחושת הצפה.",
        "center": "העץ ממוקם במרכז, מה שמעיד על איזון ויציבות בשאיפות וברגשות.",
        "high": "העץ ממוקם בחלק העליון של העמוד, דבר שמעיד על שאפתנות, מטרות גבוהות והתמקדות בהשגת יעדים."
      }
    }
  },
  "canopy": {
    "size": {
      "large_threshold": 0.6,
      "small_threshold": 0.2,
      "interpretation": {
        "small": "חופה קטנה מעידה על ביטוי חיצוני או שאיפות מוגבלות, ייתכן שמשקפת ביישנות או מופנמות.",
        "large": "חופה גדולה מעידה על מחשבות רחבות, שאיפות גדולות או דגש על הישגים חיצוניים."
      }
    },
    "shape": {
      "rounded": "חופה מעוגלת מעידה על הרמוניה, טבע שליו או דגש על איזון.",
      "pointed": "חופה מחודדת מרמזת על שאפתנות, חדות או גישה אגרסיבית יותר להשגת מטרות."
    }
  },
  "trunk": {
    "shape": {
      "straight": "גזע ישר מעיד על בסיס פנימי חזק, ביטחון עצמי וחוסן.",
      "curved": "גזע מעוקל עשוי להעיד על גמישות, הסתגלות או חוסר החלטיות, תלוי בהקשר הכללי."
    }
  },
  "roots": {
    "depth": {
      "shallow_threshold": 0.1,
      "deep_threshold": 0.3,
      "interpretation": {
        "shallow": "שורשים רדודים עשויים לשקף חיבורים שטחיים או חוסר ביטחון.",
        "deep": "שורשים עמוקים מעידים על בסיסים חזקים, עומק רגשי ואישיות יציבה."
      }
    }
  }
}
